const 공지사항아이콘 = () => {
  return (
    <svg
      id='Size_24_Theme_Regular_8_'
      data-name='Size=24, Theme=Regular (8)'
      xmlns='http://www.w3.org/2000/svg'
      width='24'
      height='24'
      viewBox='0 0 24 24'
    >
      <rect id='사각형_2680' data-name='사각형 2680' width='24' height='24' fill='#fff' />
      <path
        id='패스_38141'
        data-name='패스 38141'
        d='M21.9,5.6a1.483,1.483,0,0,1,.1.7V17.8A2.22,2.22,0,0,1,19.8,20a1.268,1.268,0,0,1-.6-.1l-5.5-1.6a4.021,4.021,0,0,1-7.6-1.6v-.2L6,16l-2.4-.7A2.378,2.378,0,0,1,2,13.1V10.8A2.378,2.378,0,0,1,3.6,8.6L19.1,4A2.4,2.4,0,0,1,21.9,5.6ZM7.5,16.4h0A2.562,2.562,0,0,0,10,19a2.438,2.438,0,0,0,2.1-1.2Zm12-10.9L4,10.1a.752.752,0,0,0-.5.7v2.3a.752.752,0,0,0,.5.7l15.5,4.6h.2a.789.789,0,0,0,.8-.8V6.1A.887.887,0,0,0,19.5,5.5Z'
        fill='#111'
      />
    </svg>
  );
};
export default 공지사항아이콘;
export { 공지사항아이콘 };
