const 스케줄변경추가요청아이콘 = () => {
  return (
    <svg
      id='Size_24_Theme_Regular_5_'
      data-name='Size=24, Theme=Regular (5)'
      xmlns='http://www.w3.org/2000/svg'
      width='20'
      height='20'
      viewBox='0 0 20 20'
    >
      <rect id='사각형_8' data-name='사각형 8' width='20' height='20' fill='none' />
      <path
        id='패스_2'
        data-name='패스 2'
        d='M17.377,5.558A2.645,2.645,0,0,0,14.742,3H5.556A2.629,2.629,0,0,0,3,5.558V14.75a2.645,2.645,0,0,0,2.556,2.638H9.47l.319-1.119v-.08H5.556A1.347,1.347,0,0,1,4.2,14.83V7.4H16.179V9.555a3.1,3.1,0,0,1,1.2-.16ZM5.556,4.2h9.186A1.347,1.347,0,0,1,16.1,5.558V6.2H4.118V5.558A1.537,1.537,0,0,1,5.556,4.2Zm10.3,6.555L11.147,15.47a2.338,2.338,0,0,0-.559.959l-.4,1.439a.848.848,0,0,0,1.038,1.039l1.438-.4a1.917,1.917,0,0,0,.958-.56l4.713-4.716a1.787,1.787,0,0,0,0-2.558A1.692,1.692,0,0,0,15.86,10.754Z'
        fill='#fff'
      />
    </svg>
  );
};

export default 스케줄변경추가요청아이콘;
export { 스케줄변경추가요청아이콘 };
